Autodesk.Revit.DB.Plumbing.IPipePressureDropServerProxy.GetHtmlDescription
The method that Revit will invoke to get an HTML formatted description of the server.
Remarks:
The HTML description is used by Revit unless it is empty or the server is not available, in which case, Revit will use the plain text description from IExternalServer.GetDescription().
Returns:
The HTML format description of the server.
Since:
2014

Autodesk.Revit.DB.Plumbing.IPipePressureDropServerProxy.GetInformationLink
The method that Revit will invoke to obtain a URL address which provides more information about the server.
Returns:
The URL providing server information.
Since:
2014

Autodesk.Revit.DB.Plumbing.IPipePressureDropServerProxy.Calculate(Autodesk.Revit.DB.Plumbing.PipePressureDropData)
Calculate the pipe pressure drop.
data:
The input and output data of the calculation.
Since:
2014